app/controllers/store_controller.rb

SELECT `products`.* FROM `products` WHERE (prod_amount > '0')
---
  def index
    @products = Product.where("prod_amount > ?","0" )