app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "MyString"], ["email", "MyString"], ["created_at", "2015-08-22 02:17:49.030710"], ["updated_at", "2015-08-22 02:17:49.030710"]]
---
  def create
    @user = User.new user_params
    if @user.save