app/views/store/_cart_free_items.html.erb

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1  [["id", 1]]
---
    <span style="margin-right:80px;">
      <%= link_to image_tag(Product.find(f.fid).prod_img, :id => "pimgs"), store_show_product_path(:id => f.fid) %> x <%= f.fqty %>