app/views/store/_products.html.erb

    <span id="pntc">
      <% if product.discounts.any? then %>Discount! <% end %>
      <% if product.valid_freebies.any? then %>Freebie! <% end %>
---
SELECT  1 AS one FROM `discounts` WHERE `discounts`.`product_id` = 1 LIMIT 1
SELECT `freebies`.* FROM `freebies` WHERE `freebies`.`product_id` = 1